In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/lahman-baseball")

In [8]:
# use the connection to run a query using pandas!
batting = pd.read_sql("SELECT * FROM batting;", con=engine)

In [42]:
batting.head(2)

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN

# Question 1 
## a. Find all players in the database who played at Vanderbilt University.
    ### print(unique_vandy_players)
## b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.
## c. Sort this list in descending order by the total salary earned.
## d. Which Vanderbilt player earned the most money in the majors?

In [10]:
#read in the schools, people, salaries and collegeplayers tables
schools = pd.read_sql("SELECT * FROM Schools;", con=engine)

In [13]:
college_players=pd.read_sql("SELECT * FROM CollegePlaying;", con=engine)

In [19]:
player_info=pd.read_sql("SELECT * FROM people;", con=engine)

In [20]:
player_info.head()

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,namelast,namegiven,weight,height,bats,throws,debut,finalgame,retroid,bbrefid
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,Aardsma,David Allan,215.0,75.0,R,R,2004-04-06,2015-08-23,aardd001,aardsda01
1,aaronha01,1934.0,2.0,5.0,USA,AL,Mobile,NaN,NaN,NaN,...,Aaron,Henry Louis,180.0,72.0,R,R,1954-04-13,1976-10-03,aaroh101,aaronha01
2,aaronto01,1939.0,8.0,5.0,USA,AL,Mobile,1984.0,8.0,16.0,...,Aaron,Tommie Lee,190.0,75.0,R,R,1962-04-10,1971-09-26,aarot101,aaronto01
3,aasedo01,1954.0,9.0,8.0,USA,CA,Orange,NaN,NaN,NaN,...,Aase,Donald William,190.0,75.0,R,R,1977-07-26,1990-10-03,aased001,aasedo01
4,abadan01,1972.0,8.0,25.0,USA,FL,Palm Beach,NaN,NaN,NaN,...,Abad,Fausto Andres,184.0,73.0,L,L,2001-09-10,2006-04-13,abada001,abadan01

In [21]:
salaries=pd.read_sql("SELECT * FROM salaries;", con=engine)

In [22]:
salaries.head()

   yearid teamid lgid   playerid    salary
0    1985    ATL   NL  barkele01  870000.0
1    1985    ATL   NL  bedrost01  550000.0
2    1985    ATL   NL  benedbr01  545000.0
3    1985    ATL   NL   campri01  633333.0
4    1985    ATL   NL  ceronri01  625000.0

In [25]:
q1_1 = pd.merge(schools, college_players, on=['schoolid'])

In [28]:
q1_2=pd.merge(q1_1, salaries, on=['playerid'])

In [31]:
q1_2.head(2)

,schoolid,schoolname,schoolcity,schoolstate,schoolnick,playerid,yearid_x,yearid_y,teamid,lgid,salary
0,akron,University of Akron,Akron,OH,USA,birkbmi01,1980,1986,ML4,AL,60000.0
1,akron,University of Akron,Akron,OH,USA,birkbmi01,1980,1987,ML4,AL,70000.0

In [33]:
q1_2.set_index('schoolname', inplace=True)

In [36]:
vandy=q1_2.loc['Vanderbilt University']

In [38]:
unique_vandy_players=vandy['playerid'].unique()   #this produces a numpy.ndarray as unique_vandy_players

In [41]:
print(unique_vandy_players)

['baxtemi01' 'priorma01' 'alvarpe01' 'chrisni01' 'corajo01' 'flahery01'
 'grayso01' 'katama01' 'lewisje01' 'madissc01' 'minormi01' 'pauljo01'
 'priceda01' 'sandesc01' 'sowerje01']

In [43]:
q1_3=pd.merge(player_info, salaries, on=['playerid'])

In [44]:
q1_3.head()  #players and salaries

,playerid,birthyear,birthmonth,birthday,birthcountry,birthstate,birthcity,deathyear,deathmonth,deathday,...,bats,throws,debut,finalgame,retroid,bbrefid,yearid,teamid,lgid,salary
0,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2004,SFN,NL,300000.0
1,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2007,CHA,AL,387500.0
2,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2008,BOS,AL,403250.0
3,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2009,SEA,AL,419000.0
4,aardsda01,1981.0,12.0,27.0,USA,CO,Denver,NaN,NaN,NaN,...,R,R,2004-04-06,2015-08-23,aardd001,aardsda01,2010,SEA,AL,2750000.0

In [67]:
vandy_names0= q1_3.loc[q1_3['playerid'].isin(['unique_vandy_players']), "namefirst"] #returns a pandas Series

In [68]:
print(vandy_names0)

Series([], Name: namefirst, dtype: object)